AndyD87/CcOS/Sources/CcKernel/Driver/CPU/ST/Common/STM32UsbDevice.cpp

/*
 * This file is part of CcOS.
 *
 * CcOS is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * CcOS is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with CcOS.  If not, see <http://www.gnu.org/licenses/>.
 **/

#include "STM32UsbDevice.h"
#include "CcKernel.h"
#include "CcDevice.h"
#include "CcStatic.h"
#include "usbh_conf.h"

#define USBD_EP_TYPE_BULK                               0x02U

void HAL_PCD_MspInit(PCD_HandleTypeDef* pcdHandle)
{
  HAL_Custom_MspInit(pcdHandle);
}

void HAL_PCD_MspDeInit(PCD_HandleTypeDef* pcdHandle)
{
  HAL_Custom_MspDeinit(pcdHandle);
}

/**
  * @brief  Data OUT stage callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  static_cast<STM32UsbDevice*>(hpcd->pData)->doOutputData(epnum, hpcd->OUT_ep[epnum].xfer_buff);
}

/**
  * @brief  Data IN stage callback
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  static_cast<STM32UsbDevice*>(hpcd->pData)->doInputData(epnum, hpcd->IN_ep[epnum].xfer_buff);
}
/**
  * @brief  Setup stage callback
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
  static_cast<STM32UsbDevice*>(hpcd->pData)->doSetup();
}

/**
  * @brief  USB Start Of Frame callback.
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  //IUsbDevice::debugMessage("HAL_PCD_SOFCallback");
}

/**
  * @brief  USB Reset callback.
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
  static_cast<STM32UsbDevice*>(hpcd->pData)->doReset();
}

/**
  * @brief  Suspend event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
  static_cast<STM32UsbDevice*>(hpcd->pData)->setUsbState(STM32UsbDevice::EUsbState::Suspended);
}

/**
  * @brief  Resume event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
  static_cast<STM32UsbDevice*>(hpcd->pData)->setUsbState(STM32UsbDevice::EUsbState::Resume);
}

/**
  * @brief  Incomplete ISO OUT callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);
  IUsbDevice::debugMessage("HAL_PCD_ResumeCallback");
}

/**
  * @brief  Incomplete ISO IN callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);
  IUsbDevice::debugMessage("HAL_PCD_ISOINIncompleteCallback");
}

/**
  * @brief  Connection event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  IUsbDevice::debugMessage("HAL_PCD_ConnectCallback");
}

/**
  * @brief  Disconnection event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  IUsbDevice::debugMessage("HAL_PCD_DisconnectCallback");
}


STM32UsbDevice* s_pInstance = nullptr;

#ifdef USB_EXTENDED_OFF
  /**
   * @brief  This function handles USB-On-The-Go HS global interrupt request.
   */
  CCEXTERNC void USB_LP_CAN1_RX0_IRQHandler(void)
  {
    if(s_pInstance)
      HAL_PCD_IRQHandler(s_pInstance->getPcdHandle());
  }
#else
  /**
   * @brief  This function handles USB-On-The-Go FS/HS global interrupt request.
   */
  CCEXTERNC void OTG_HS_IRQHandler(void)
  {
    if(s_pInstance)
      HAL_PCD_IRQHandler(s_pInstance->getPcdHandle());
  }

  /**
   * @brief  This function handles USB-On-The-Go HS global interrupt request.
   */
  CCEXTERNC void OTG_FS_IRQHandler(void)
  {
    if(s_pInstance)
      HAL_PCD_IRQHandler(s_pInstance->getPcdHandle());
  }
#endif

STM32UsbDevice::STM32UsbDevice()
{
  s_pInstance = this;
  CcStatic_memsetZeroObject(m_oPcdHandle);
}

STM32UsbDevice::~STM32UsbDevice()
{
  s_pInstance = nullptr;
}

CcStatus STM32UsbDevice::onState(EState eState)
{
  CcStatus bSuccess = true;
  switch(eState)
  {
    case EState::Start:
      bSuccess = onStart();
      if(bSuccess)
      {
        if(HAL_OK != HAL_PCD_Start(getPcdHandle()))
        {
          bSuccess = false;      }
        else
        {
          registerIdle();
        }
      }
      break;
    case EState::Stop:
      deregisterIdle();
      HAL_PCD_Stop(getPcdHandle());
      HAL_PCD_DeInit(getPcdHandle());
      break;
    default:
      break;
  }
  return bSuccess;
}

void STM32UsbDevice::idle()
{
  if(m_eCurrentSate == EUsbState::Configured)
  {
    IUsbDevice::CConfigDescriptor& oConfig = m_oDeviceDescriptor.getActiveConfig();
    for(CConfigDescriptor::CEndpointInfo& oInfo : oConfig.getEndpointInfos())
    {
      // Check for pending reads
      if(oInfo.pDescriptor->uiEndpointAddress < 80)
      {
        if(oInfo.oBufferList.getChunkCount())
        {
          oInfo.oOnChange.call(&oInfo);
        }
      }
      // Check for pending writes
      else
      {
        // Check if write is already active
        if(oInfo.eState == EEnpointState::DataIn &&
            oInfo.oBufferList.getChunkCount())
        {
          //HAL_PCD_EP_Transmit(getPcdHandle(), oInfo.pDescriptor->uiEndpointAddress, oInfo.oBufferList[0].cast<uint8>(), oInfo.oBufferList[0].size());
        }
      }
    }
  }
}

CcStatus STM32UsbDevice::onStart()
{
  CcStatus oStatus = EStatus::CommandInvalidParameter;
  
