AndyD87/CcOS/Sources/CcKernel/Driver/CPU/ST/Common/STM32UsbDevice.cpp
  /*Set LL Driver parameters */
  #ifdef HS
    m_oPcdHandle.Instance                 = USB_OTG_HS;
    m_oPcdHandle.Init.dev_endpoints       = getDeviceDescriptor().getActiveConfig().getEndpointCount();
    m_oPcdHandle.Init.speed               = PCD_SPEED_FULL;
    m_oPcdHandle.Init.dma_enable          = DISABLE;
    m_oPcdHandle.Init.phy_itface          = USB_OTG_EMBEDDED_PHY;
    m_oPcdHandle.Init.Sof_enable          = DISABLE;
    m_oPcdHandle.Init.low_power_enable    = DISABLE;
    m_oPcdHandle.Init.vbus_sensing_enable = ENABLE;
    m_oPcdHandle.Init.use_dedicated_ep1   = DISABLE;
  #else
    m_oPcdHandle.Init.dev_endpoints       = getDeviceDescriptor().getActiveConfig().getEndpointCount();
    m_oPcdHandle.Init.phy_itface          = PCD_PHY_EMBEDDED;
    m_oPcdHandle.Init.Sof_enable          = DISABLE;
    m_oPcdHandle.Init.low_power_enable    = DISABLE;
    m_oPcdHandle.Init.speed               = PCD_SPEED_FULL;
    #ifndef USB_EXTENDED_OFF
      m_oPcdHandle.Instance                 = USB_OTG_FS;
      m_oPcdHandle.Init.dma_enable          = DISABLE;
      m_oPcdHandle.Init.vbus_sensing_enable = DISABLE;
      m_oPcdHandle.Init.use_dedicated_ep1   = DISABLE;
    #else
      m_oPcdHandle.Instance                 = USB;
      m_oPcdHandle.Init.lpm_enable = DISABLE;
      m_oPcdHandle.Init.battery_charging_enable = DISABLE;
    #endif
  #endif
  /* Link The driver to the stack */
  m_oPcdHandle.pData = this;

  __HAL_RCC_USB_OTG_HS_CLK_ENABLE();

  if(HAL_OK == HAL_PCD_Init(getPcdHandle()))
  {
    #ifdef USB_EXTENDED_OFF
      HAL_PCDEx_PMAConfig(getPcdHandle(), 0x00 , PCD_SNG_BUF, m_uiPmaOffset);
      m_uiPmaOffset += m_uiEp0MaxSize;
      HAL_PCDEx_PMAConfig(getPcdHandle(), 0x80 , PCD_SNG_BUF, m_uiPmaOffset);
      m_uiPmaOffset += m_uiEp0MaxSize;
    #elif defined(HS)
      HAL_PCDEx_SetRxFiFo(getPcdHandle(), m_uiEp0MaxSize);
      HAL_PCDEx_SetTxFiFo(getPcdHandle(), 0, 0x80);
    #else
      HAL_PCDEx_SetRxFiFo(getPcdHandle(), m_uiEp0MaxSize);
      HAL_PCDEx_SetTxFiFo(getPcdHandle(), 0, 0x40);
    #endif
    //Configure and open endpoints. Enpoint interfaces are required
    IUsbDevice::CConfigDescriptor& oConfig = m_oDeviceDescriptor.getActiveConfig();
    for(size_t uiIdx=0; uiIdx<oConfig.getEndpointCount(); uiIdx++)  
    { 
      IUsbDevice::SEndpointDescriptor* pEndPoint = oConfig.getEndpoint(uiIdx);
      if(pEndPoint->uiEndpointAddress == 0 ||
          pEndPoint->uiEndpointAddress == 0x80)
      { 
        // Nothing to do, it is our default config
      }
      else if(pEndPoint->uiEndpointAddress < 0x80)
      {
        #ifdef USB_EXTENDED_OFF
          HAL_PCDEx_PMAConfig(getPcdHandle(), pEndPoint->uiEndpointAddress, PCD_SNG_BUF, m_uiPmaOffset);
          m_uiPmaOffset += pEndPoint->wMaxPacketSize;
        #endif
      }
      else
      {
        #ifdef USB_EXTENDED_OFF
          HAL_PCDEx_PMAConfig(getPcdHandle(), pEndPoint->uiEndpointAddress, PCD_SNG_BUF, m_uiPmaOffset);
          m_uiPmaOffset += pEndPoint->wMaxPacketSize;
        #else
          HAL_PCDEx_SetTxFiFo(getPcdHandle(), pEndPoint->uiEndpointAddress & ~0x80, pEndPoint->wMaxPacketSize);
        #endif
      }
    }
    oStatus = true;
  }
  return oStatus;
}

void STM32UsbDevice::setUsbState(EUsbState eNewState)
{
  switch(eNewState) 
  {
    case EUsbState::Connected:
    {
      // EPTypes:
      //   EP_TYPE_CTRL                           0U
      //   EP_TYPE_ISOC                           1U
      //   EP_TYPE_BULK                           2U
      //   EP_TYPE_INTR                           3U
      //   EP_TYPE_MSK                            3U
      // configure endpoints!
      /* Open EP0 OUT */
      HAL_StatusTypeDef status = HAL_PCD_EP_Open(getPcdHandle(), 0x00, m_uiEp0MaxSize, EP_TYPE_CTRL);
      /* Open EP0 IN */
      if(status == HAL_OK || status == HAL_BUSY)
      {
        status = HAL_PCD_EP_Open(getPcdHandle(), 0x80, m_uiEp0MaxSize, EP_TYPE_CTRL);
      }
      m_eCurrentSate = eNewState; 
      break;
    }
    case EUsbState::Addressed:
      CCFALLTHROUGH;
    case EUsbState::Configured:
      m_eCurrentSate = eNewState;       
      break;
    case EUsbState::Suspended:
    {
      __HAL_PCD_GATE_PHYCLOCK(getPcdHandle());
      // Close all endpoints
      HAL_PCD_EP_Close(getPcdHandle(), 0x00);
      HAL_PCD_EP_Close(getPcdHandle(), 0x80);
      IUsbDevice::CConfigDescriptor& oConfig = m_oDeviceDescriptor.getActiveConfig();
      for(size_t uiIdx=0; uiIdx<oConfig.getEndpointCount(); uiIdx++)  
      { 
        IUsbDevice::SEndpointDescriptor* pEndPoint = oConfig.getEndpoint(uiIdx);
        HAL_PCD_EP_Close(
          getPcdHandle(), 
          pEndPoint->uiEndpointAddress
        );
      }
      m_eOldState = m_eCurrentSate;
      m_eCurrentSate = eNewState; 
      break;
    }
    case EUsbState::Resume:
      // Reload old state
      if(m_eCurrentSate == EUsbState::Suspended)
        m_eCurrentSate = m_eOldState; 
    break;
  }
}

void STM32UsbDevice::doReset()
{
  setUsbState(Connected);
}

#define  SWAPBYTE(addr)        (((uint16_t)(*((uint8_t *)(addr)))) + \
                               (((uint16_t)(*(((uint8_t *)(addr)) + 1U))) << 8U))

void STM32UsbDevice::doSetup()
{
  SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);

  switch (pRequest->bmRequest & 0x1FU)
  {
    case UsbRequestTarget_DEVICE:
      doSetupDevice();
      break;

    case UsbRequestTarget_INTERFACE:
      doSetupInterface();
      break;

    case UsbRequestTarget_ENDPOINT:
      doSetupEndPoint();
      break;

    default:
      IUsbDevice::debugMessage("Unknown Request");
      stallEp(0x80);
      break;
  }
}


void STM32UsbDevice::doSetupDevice()
{
  SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
  switch (pRequest->bmRequest & UsbRequestType_MASK)
  {
    case UsbRequestType_STANDARD:
      switch (pRequest->bRequest)
      {
        case UsbRequest_GET_DESCRIPTOR:
          doSetupDeviceDescriptor();
          break;
        case UsbRequest_SET_ADDRESS:
          if ((pRequest->wIndex == 0U) && (pRequest->wLength == 0U) && (pRequest->wValue < 128U))
          {
            if(m_eCurrentSate == EUsbState::Configured)
            {
              // Write Error
              IUsbDevice::debugMessage("Error already configured");
            }
            else
            {
              m_uiUsbAddress = (uint8_t)(pRequest->wValue) & 0x7FU;
              HAL_PCD_SetAddress(getPcdHandle(), m_uiUsbAddress);
             
              ctrlSendStatus();

