AndyD87/CcOS/Sources/CcKernel/Driver/CPU/ST/Common/STM32UsbDevice.cpp
              if (m_uiUsbAddress != 0U)
              {
                setUsbState(EUsbState::Addressed);
              }
              else
              {
                setUsbState(EUsbState::Connected);
              }
            }
          }
          else
          {
            IUsbDevice::debugMessage("Invalid request");
          }
          break;
        case UsbRequest_SET_CONFIGURATION:
          doSetConfiguration();
          setUsbState(EUsbState::Configured);
          ctrlSendStatus();
          break;
        case UsbRequest_GET_CONFIGURATION:
        case UsbRequest_GET_STATUS:
        case UsbRequest_SET_FEATURE:
        case UsbRequest_CLEAR_FEATURE:
        default:
          IUsbDevice::debugMessage("UsbRequest_...");
          break;
      }
      break;
    case UsbRequestType_CLASS:
    case UsbRequestType_VENDOR:
    default:
      IUsbDevice::debugMessage("UsbRequestType_CLASS/UsbRequestType_VENDOR");
      break;

  }
}

void STM32UsbDevice::doSetupDeviceDescriptor()
{
  SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
  uint8* pBuffer = nullptr;
  uint16 uiSize = 0;

  //m_eEp0State = EEnpointState::Setup;

  switch(pRequest->wValue >> 8)
  {
    case UsbDescriptorType_DEVICE:
      pBuffer = reinterpret_cast<uint8*>(&m_oDeviceDescriptor);
      uiSize = m_oDeviceDescriptor.uiLength;
      break;
    case UsbDescriptorType_STRING:
      doSetupDeviceDescriptorString(pBuffer, uiSize);
      break;
    case UsbDescriptorType_CONFIGURATION:
      doSetupDeviceConfigDescriptor(pBuffer, uiSize);
      break;
    case UsbDescriptorType_DEVICE_QUALIFIER:
      ctrlSendError();
      break;
    case UsbDescriptorType_OTHER_SPEED_CONFIGURATION:
    default:
      //IUsbDevice::debugMessage("Test");
      break;
  }
  if(pBuffer != nullptr && uiSize > 0)
  {
    write(0, pBuffer, CCMIN(uiSize, pRequest->wLength));
  }
  else
  {
    ctrlSendStatus();
  }
}

void STM32UsbDevice::doSetupDeviceDescriptorString(uint8*& pBuffer, uint16& uiSize)
{
  SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
  uint8 uiIndex = (pRequest->wValue & 0xff);
  if(uiIndex < m_oDeviceDescriptor.getStrings().size())
  {
    pBuffer = reinterpret_cast<uint8*>(m_oDeviceDescriptor.getStrings()[uiIndex]);
    uiSize = m_oDeviceDescriptor.getStrings()[uiIndex]->uiLength;
  }
}

void STM32UsbDevice::doSetupDeviceConfigDescriptor(uint8*& pBuffer, uint16& uiSize)
{
  pBuffer = reinterpret_cast<uint8*>(m_oDeviceDescriptor.getActiveConfig().getConfig());
  uiSize = m_oDeviceDescriptor.getActiveConfig().getConfig()->uiTotalLength;
}

void STM32UsbDevice::doSetupInterface()
{
  SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
  /* Find the class ID relative to the current request */
  switch (pRequest->bmRequest & 0x1FU)
  {
    case UsbRequestTarget_INTERFACE:
    {
      CConfigDescriptor* pConfig;
      m_oDeviceDescriptor.findInterface(pRequest->wIndex, &pConfig);
      if(pConfig)
      {
        pConfig->getInterfaceInfo(pRequest->wIndex).oOnRequest.call(pRequest);
      }
      break;
    }
    case UsbRequestTarget_ENDPOINT:
      IUsbDevice::debugMessage("STM32UsbDevice::doOutputData Endpoint request");
      break;
    default:
      IUsbDevice::debugMessage("STM32UsbDevice::doOutputData Unknown request");
      break;
  }
}

void STM32UsbDevice::doSetupEndPoint()
{
  SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
  switch (pRequest->bRequest)
  {
    case UsbRequest_SET_FEATURE:
      if (pRequest->wValue == UsbFeature_EP_HALT)
      {
        HAL_PCD_EP_SetStall(getPcdHandle(), pRequest->wIndex & 0xff);
      }
      else
      {
        IUsbDevice::debugMessage("STM32UsbDevice::doSetupEndPoint UsbRequest_SET_FEATURE unknown");
      }
      break;
    case UsbRequest_CLEAR_FEATURE:
      if (pRequest->wValue == UsbFeature_EP_HALT)
      {
        HAL_PCD_EP_ClrStall(getPcdHandle(), pRequest->wIndex & 0xff);
      }
      else
      {
        IUsbDevice::debugMessage("STM32UsbDevice::doSetupEndPoint UsbRequest_CLEAR_FEATURE unknown");
      }
      break;
    case UsbRequest_GET_STATUS:
      IUsbDevice::debugMessage("STM32UsbDevice::doSetupEndPoint UsbRequest_GET_STATUS request");
      break;
  }
}

void STM32UsbDevice::doSetConfiguration()
{
  //SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
  if(m_eCurrentSate == EUsbState::Addressed)
  {
    // @todo Configure and open endpoints. Enpoint interfaces are required
    IUsbDevice::CConfigDescriptor& oConfig = m_oDeviceDescriptor.getActiveConfig();
    for(size_t uiIdx=0; uiIdx<oConfig.getEndpointCount(); uiIdx++)  
    { 
      IUsbDevice::SEndpointDescriptor* pEndPoint = oConfig.getEndpoint(uiIdx);
      IUsbDevice::CConfigDescriptor::CEndpointInfo& oEndPointInfo = oConfig.getEndpointInfo(uiIdx);
      
      HAL_StatusTypeDef uiHallResult = HAL_PCD_EP_Open(
                                          getPcdHandle(), 
                                          pEndPoint->uiEndpointAddress,
                                          pEndPoint->wMaxPacketSize,
                                          pEndPoint->uiAttributes
                                        );
      if(uiHallResult != HAL_OK)
      {
        IUsbDevice::debugMessage(("Failed to setup endpoint: " + CcString::fromNumber((uint8)uiHallResult)).getCharString());
      }
      else if(pEndPoint->uiEndpointAddress == 0 ||
          pEndPoint->uiEndpointAddress == 0x80)
      { 
        // Nothing to do, it is our default config
      }
      else if(pEndPoint->uiEndpointAddress < 0x80)
      {
        // Setup receive buffer
        oEndPointInfo.oInBuffer.resize(pEndPoint->wMaxPacketSize);
        uiHallResult = HAL_PCD_EP_Receive(
          getPcdHandle(), 
          pEndPoint->uiEndpointAddress,
          oEndPointInfo.oInBuffer.cast<uint8>(), 
          pEndPoint->wMaxPacketSize
        );
        // Prepare receive
        if(HAL_OK != uiHallResult)
        {
          IUsbDevice::debugMessage("Failed to setup receive endpoint");
        }
      }
      else
      {
        #ifndef USB_EXTENDED_OFF
          HAL_PCDEx_SetTxFiFo(getPcdHandle(), pEndPoint->uiEndpointAddress & ~0x80, pEndPoint->wMaxPacketSize);
        #endif
      }
    }
  }
}

void STM32UsbDevice::doInputData(uint8 uiEndpoint, uint8* pBuffer)
{
  if(uiEndpoint == 0)
  {
    if(m_eEp0State == EEnpointState::DataIn)
    {
      if(m_uiWriteSize > m_uiEp0MaxSize)
      {
        m_uiWriteSize -= m_uiEp0MaxSize;
        write(uiEndpoint, pBuffer, m_uiWriteSize);
        
        // Prepare for suprised transer end
        HAL_PCD_EP_Receive(getPcdHandle(), 0, nullptr, 0);
      }
      else
      {
        stallEp(0x80U);

        // Prepare receive
        ctrlReceiveStatus();
      }
    }
    else if(m_eEp0State == EEnpointState::StateIn ||
            m_eEp0State == EEnpointState::Idle)
    {
      stallEp(0x80U);
    }
    else
    {
      IUsbDevice::debugMessage("Invalid Ctrl IN called");
    }
  }
  else
  {
    uiEndpoint |= 0x80;
    CConfigDescriptor* pConfig = nullptr;
    uint8 uiIdx = m_oDeviceDescriptor.findEndpoint(uiEndpoint, &pConfig);
    if(pConfig)
    {
      CConfigDescriptor::CEndpointInfo& oEndpointInfo = pConfig->getEndpointInfo(uiIdx);
      if(oEndpointInfo.oBufferList.getChunkCount() > 0)
      {
        if(oEndpointInfo.oBufferList[0].size() > oEndpointInfo.pDescriptor->wMaxPacketSize)
        {
          oEndpointInfo.oBufferList[0].remove(0, oEndpointInfo.pDescriptor->wMaxPacketSize);
        }
        else
        {
          oEndpointInfo.oBufferList.removeChunk(0);
        }
        if(oEndpointInfo.oBufferList.getChunkCount() > 0)
        {
          // Send next packet
          HAL_PCD_EP_Transmit(getPcdHandle(), uiEndpoint, oEndpointInfo.oBufferList[0].cast<uint8>(), oEndpointInfo.oBufferList[0].size());
        }
        else
        {
          // Idle state, wait for new input
          oEndpointInfo.eState = EEnpointState::Idle;
        }
      }
      else
      {
        // Quit Package request, we have no package to send.
        // Send Zero Length Package
        HAL_PCD_EP_Transmit(getPcdHandle(), uiEndpoint, nullptr, 0);
      }
    }
    else
    {
      IUsbDevice::debugMessage("Invalid Endpoint IN called");
    }
  }
}

void STM32UsbDevice::doOutputData(uint8 uiEndpoint, uint8* pBuffer)
{
  if(uiEndpoint == 0)
  {                                                                                                                                    
    // Check if more data is required
    if(m_eEp0State == EEnpointState::DataOut)
    {
      if(m_uiReadSize > m_uiEp0MaxSize)
      {
        m_uiReadSize -= m_uiEp0MaxSize;
        read(uiEndpoint, pBuffer, m_uiReadSize);
      }
      else
      {
        SRequest* pRequest = reinterpret_cast<SRequest*>(m_oPcdHandle.Setup);
        
        /* Find the class ID relative to the current request */
        switch (pRequest->bmRequest & 0x1FU)
        {
          case UsbRequestTarget_INTERFACE:
          {
            CConfigDescriptor* pConfig;
            m_oDeviceDescriptor.findInterface(pRequest->wIndex, &pConfig);
            if(pConfig)
            {
              CConfigDescriptor::CInterfaceInfo& oInterface = pConfig->getInterfaceInfo(pRequest->wIndex);
              // Signal transfer done
              oInterface.oOnReadDone.call(pRequest);
            }
            break;
          }
          case UsbRequestTarget_ENDPOINT:
            IUsbDevice::debugMessage("STM32UsbDevice::doOutputData Endpoint request");
            break;
          default:
            break;
        }

        ctrlSendStatus();
      }
    }
    // Check if more data is required
    else if(m_eEp0State == EEnpointState::StateOut)
    {
      m_eEp0State = EEnpointState::Idle;
      stallEp(0U);
    }
    else
    {
      IUsbDevice::debugMessage("Invalid Ctrl OUT called");
    }
  }
  else
  {
    CConfigDescriptor* pConfig = nullptr;
    uint8 uiIdx = m_oDeviceDescriptor.findEndpoint(uiEndpoint, &pConfig);
    if(pConfig)
    {
      // Write data to buffer list
      CConfigDescriptor::CEndpointInfo& oEndpointInfo = pConfig->getEndpointInfo(uiIdx);
      if(oEndpointInfo.oBufferList.getChunkCount() < oEndpointInfo.uiMaxBufferList)
      {
        oEndpointInfo.oBufferList.append(oEndpointInfo.oInBuffer.getArray(), getPcdHandle()->OUT_ep[uiEndpoint].xfer_count);
      }

