AndyD87/CcOS/Sources/CcKernel/Driver/CPU/ST/Common/STM32UsbDevice.cpp
      // Reset Input buffer
      read(uiEndpoint, oEndpointInfo.oInBuffer.cast<uint8>(), oEndpointInfo.oInBuffer.size());
    }
    else
    {
      IUsbDevice::debugMessage("Invalid Endpoint OUT called");
    }
  }
}

void STM32UsbDevice::write(uint8 uiEndpoint, const uint8* pBuffer, uint16 uiSize)
{
  CConfigDescriptor* pConfig = nullptr;
  if(uiEndpoint != 0)
  {
    uint8 uiIdx = m_oDeviceDescriptor.findEndpoint(uiEndpoint, &pConfig);
    if(pConfig)
    {
      CConfigDescriptor::CEndpointInfo& oEndpointInfo = pConfig->getEndpointInfo(uiIdx);
      
      if(oEndpointInfo.oBufferList.size() < oEndpointInfo.uiMaxBufferList)
        oEndpointInfo.oBufferList.append(pBuffer, uiSize);
      else
      {
        IUsbDevice::debugMessage("Buffer exceeded");
      }

      // Check if write is already active
      if( m_eCurrentSate == EUsbState::Configured && 
          oEndpointInfo.eState == EEnpointState::Idle)
      {
        oEndpointInfo.eState = EEnpointState::DataIn;
        HAL_PCD_EP_Transmit(getPcdHandle(), uiEndpoint, oEndpointInfo.oBufferList[0].cast<uint8>(), oEndpointInfo.oBufferList[0].size());
      }
    }
  }
  else
  {
    m_uiWriteSize = uiSize;
    m_eEp0State = EEnpointState::DataIn;
    if(HAL_OK == HAL_PCD_EP_Transmit(getPcdHandle(), uiEndpoint, const_cast<uint8*>(pBuffer), uiSize))
    {
    }
  }
}

void STM32UsbDevice::read(uint8 uiEndpoint, uint8* pBuffer, uint16 uiSize)
{
  if(uiEndpoint != 0)
  {
    if(HAL_OK == HAL_PCD_EP_Receive(getPcdHandle(), uiEndpoint, pBuffer, uiSize))
    {
    }
  }
  else
  {
    m_uiReadSize = uiSize;
    m_eEp0State = EEnpointState::DataOut;
    if(HAL_OK == HAL_PCD_EP_Receive(getPcdHandle(), uiEndpoint, pBuffer, uiSize))
    {
    }
  }
}

void STM32UsbDevice::stallEp(uint8 uiEndpoint)
{
  HAL_PCD_EP_SetStall(getPcdHandle(), uiEndpoint);
}

void STM32UsbDevice::ctrlSendError()
{
  stallEp(0);
  stallEp(0x80);
}

void STM32UsbDevice::ctrlSendStatus()
{
   m_eEp0State = EEnpointState::StateIn;
  HAL_PCD_EP_Transmit(getPcdHandle(), 0, nullptr, 0);
}

void STM32UsbDevice::ctrlReceiveStatus()
{
  m_eEp0State = EEnpointState::StateOut;
  HAL_PCD_EP_Receive(getPcdHandle(), 0, nullptr, 0);
}
